sellwanger/Monitor-SEN66/sdkconfig.defaults
# Target
CONFIG_IDF_TARGET="esp32s3"

# CPU
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# Flash: 16MB QIO
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# PSRAM: 8MB octal @ 80MHz (ESP32-S3R8)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=4096
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y

# Tabla de particiones con dos slots de app (OTA)
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# --- Seguridad OTA -------------------------------------------------------
# Rollback: una imagen OTA que arranca pero no llega a confirmarse en app_main
# (esp_ota_mark_app_valid_cancel_rollback) se revierte sola a la anterior en el
# siguiente reinicio. Protege de subir por el panel un .bin que bootea y muere.
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# Firma de imagenes de app SIN secure boot ni quemar eFuses: con esto, /api/ota
# RECHAZA cualquier .bin que no vaya firmado con la clave privada del proyecto.
# Es la unica defensa criptografica contra que alguien flashee firmware propio.
#
# Requiere generar la clave UNA vez y guardarla FUERA del repo:
#   espsecure.py generate_signing_key --version 1 secure_boot_signing_key.pem
#
# Esta comentado porque sin la clave el build falla a proposito. Descomentalo
# tras generarla (imprescindible antes de exponer el aparato a una red con
# equipos poco fiables):
#CONFIG_SECURE_SIGNED_APPS_NO_SECURE_BOOT=y
#CONFIG_SECURE_SIGNED_ON_UPDATE_NO_SECURE_BOOT=y
#CONFIG_SECURE_SIGNED_APPS_ECDSA_SCHEME=y
#CONFIG_SECURE_BOOT_SIGNING_KEY="secure_boot_signing_key.pem"

# Tick de 1ms: animaciones LVGL suaves
CONFIG_FREERTOS_HZ=1000

CONFIG_COMPILER_OPTIMIZATION_PERF=y

# TLS necesita RAM interna contigua; no la malgastemos en otras cosas
CONFIG_MBEDTLS_SSL_MAX_CONTENT_LEN=8192

# El servidor web sirve una pagina de config con varios campos
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
CONFIG_HTTPD_MAX_URI_LEN=512

# LVGL
CONFIG_LV_COLOR_DEPTH_16=y
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_22=y
CONFIG_LV_FONT_MONTSERRAT_28=y
CONFIG_LV_FONT_MONTSERRAT_48=y
CONFIG_LV_USE_PERF_MONITOR=n
